[A_Fortress_VillageHall H7TownHall]
mName="村镇大厅"
mDesc="提供在本城建造全新建筑的场所。\n每天提供 500 %ICON_GOLD 黄金。"

[A_Fortress_TownHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供 500 %ICON_GOLD 黄金。"

[A_Fortress_CityHall H7TownHall]
mName="城市大厅"
mDesc="每天额外提供 1000 %ICON_GOLD 黄金。"

[A_Fortress_Capitol H7TownHall]
mName="国会"
mDesc="每天额外提供 2000 %ICON_GOLD 黄金。你只能拥有一个国会。"

[A_Fortress_Fortifications_Level1 H7TownGuardBuilding]
mName="防御工事-等级1"
mDesc="为城市提供城墙和城门\n生产驻军单位直至驻军上限"

[A_Fortress_Fortifications_Level2 H7TownGuardBuilding]
mName="防御工事-等级2"
mDesc="加固城堡城墙和城门\n增加最大驻军规模\n增加增长率"

[A_Fortress_Fortifications_Level3 H7TownGuardBuilding]
mName="防御工事-等级3"
mDesc="加固城堡城墙和城门\n显著增加最大驻军规模\n降低增长率"

[A_Fortress_Foundry H7TownTower]
mName="锻造厂"
mDesc="在攻城战中为城镇提供2座塔楼。\n为防守军队中的单位增加+10 %ICON_ATTACK 攻击和+15 %ICON_DEFENSE 防御。"

[A_Fortress_MagicGuild_Level1 H7TownMagicGuild]
mName="魔法行会-等级1"
mDesc="在本城镇提供7个随机的1阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Fortress_MagicGuild_Level2 H7TownMagicGuild]
mName="魔法行会-等级2"
mDesc="在本城镇提供6个随机的2阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Fortress_MagicGuild_Level3 H7TownMagicGuild]
mName="魔法行会-等级3"
mDesc="在本城镇提供4个随机的3阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Fortress_MagicGuild_Level4 H7TownMagicGuild]
mName="魔法行会-等级4"
mDesc="在本城镇提供2个随机的4阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Fortress_HallOfHeroes H7TownBuilding]
mName="英雄殿堂"
mDesc="提供招募新英雄和战败英雄的选项。新英雄的选择在每周开始时更换。"

[A_Fortress_ShieldBarracks H7TownDwelling]
mName="盾卫军营"
mDesc="核心生物住所。\n每周可招募22个守卫者。"

[A_Fortress_ShieldHalls H7TownDwelling]
mName="护盾厅堂"
mDesc="核心生物住所升级。\n可招募并将守卫者升级为盾卫者。\n（基础产量：22/周）"

[A_Fortress_Workshop H7TownGrowthEnhancer]
mName="工坊"
mDesc="核心生物住所升级。\n每周守卫者或盾卫者的产量+11。"

[A_Fortress_KoboldBurrows H7TownDwelling]
mName="鼠型怪通道"
mDesc="核心生物住所。\n每周可招募23个鼠型怪侦察兵。"

[A_Fortress_KoboldWarrens H7TownDwelling]
mName="鼠型怪洞穴"
mDesc="核心生物住所升级。\n可招募并将鼠型怪侦察兵升级为鼠型怪探路者。\n（基础产量：23/周）"

[A_Fortress_Granary H7TownGrowthEnhancer]
mName="谷仓"
mDesc="核心生物住所升级。\n每周鼠型怪侦察兵或鼠型怪探路者的产量+12。"

[A_Fortress_BearPens H7TownDwelling]
mName="熊圈"
mDesc="核心生物住所。\n每周可招募7头战熊。"

[A_Fortress_BlackbearCages H7TownDwelling]
mName="黑熊笼"
mDesc="核心生物住所升级。\n可招募并将战熊升级为黑熊。\n（基础产量：7/周）"

[A_Fortress_FishingPond H7TownGrowthEnhancer]
mName="鱼池"
mDesc="核心生物住所升级。\n每周战熊或黑熊的产量+4。"

[A_Fortress_DisBonfire H7TownDwelling]
mName="圣灵篝火"
mDesc="精英生物住所。\n每周可招募6个女圣灵。"

[A_Fortress_ValkyrieBonfire H7TownDwelling]
mName="武神篝火"
mDesc="精英生物住所升级。\n可招募并将女圣灵升级为女武神。\n（基础产量：6/周）"

[A_Fortress_BlazingMaiden H7TownGrowthEnhancer]
mName="烈焰少女"
mDesc="精英生物住所升级。\n每周女圣灵或女武神的产量+6。"

[A_Fortress_LavaConflux H7TownDwelling]
mName="熔岩合流"
mDesc="精英生物住所。\n每周可招募6个熔岩元素。"

[A_Fortress_MagmaConflux H7TownDwelling]
mName="岩浆合流"
mDesc="精英生物住所升级。\n可招募并将熔岩元素升级为岩浆元素。\n（基础产量：6/周）"

[A_Fortress_VolcanicChimney H7TownGrowthEnhancer]
mName="火山烟囱"
mDesc="精英生物住所升级。\n每周熔岩元素/岩浆元素或硫磺魔像/火山魔像的产量+6。"

[A_Fortress_RunicChapel H7TownDwelling]
mName="符文小教堂"
mDesc="精英生物住所。\n每周可招募2个符文祭司。"

[A_Fortress_RunicTemple H7TownDwelling]
mName="符文庙宇"
mDesc="精英生物住所升级。\n可招募并将符文祭司升级为符文族长。\n（基础产量：2/周）"

[A_Fortress_FlamingPillar H7TownGrowthEnhancer]
mName="火焰立柱"
mDesc="精英生物住所升级。\n每周符文祭司或符文族长的产量+2。"

[A_Fortress_CradleOfFire H7TownDwelling]
mName="火焰摇篮"
mDesc="冠军生物住所。\n每周可招募2头红龙。"

[A_Fortress_MountainOfFire H7TownDwelling]
mName="火之山脉"
mDesc="冠军生物住所升级。\n可招募并将红龙升级为焰龙。\n（基础产量：2/周）"

[A_Fortress_HearthOfGiants H7TownDwelling]
mName="巨人之心"
mDesc="冠军生物住所。\n每周可招募2个火灵巨人。"

[A_Fortress_HearthOfEinherjars H7TownDwelling]
mName="英灵战士炉床"
mDesc="冠军生物住所升级。\n可招募并将火灵巨人升级为英灵战士。\n（基础产量：2/周）"

[A_Fortress_chambre_des_matriache H7TownDwelling]
mName="火焰符文圣殿"
mDesc="精英生物住所。\n可招募符文女族长。\n可使用"全部招募"功能招募\n（基础产量：4/周）"

[A_Fortress_chambre_des_ramparts H7TownDwelling]
mName="符文魔像熔炉"
mDesc="冠军生物住所。\n可招募符文魔像。\n可使用"全部招募"功能招募\n（基础产量：1/周）"

[A_Fortress_Armory H7TownUtilityUnitDwelling]
mName="武器库"
mDesc="战争单位生产。\n提供购买堡垒弩车的选项。"

[A_Fortress_Embassy H7TownEmbassy]
mName="外交大使"
mDesc="在此城镇控制区域内为你的英雄与中立军队谈判提供+15%成功率。"

[A_Fortress_ExchequerOffice H7TownBank]
mName="财政库"
mDesc="每周开始时，该建筑会产生你当前黄金的10%，上限为20000黄金。此收入在所有其他黄金收入之前应用。"

[A_Fortress_Marketplace H7TownMarketplace]
mName="集市"
mDesc="提供交易资源的选项。"

[A_Fortress_RuneAtelier H7TownBuilding]
mName="符文工坊"
mDesc="在此城镇控制区域内，友方英雄的符文光环效果增强50%。不受影响：平衡符文。"

[A_Fortress_RuneDesigner H7TownUtilityUnitDwelling]
mName="符文设计师"
mDesc="战争单位生产。\n提供购买符文石的选项。"

[A_Fortress_SacredFire H7TownBuilding]
mName="圣火"
mDesc="拜访英雄在接下来的3场战斗中受益于+2 %icon_might 力量和+5 %icon_leadership 领导力。"

[A_Fortress_ShrineOfArkath H7TownBuilding]
mName="阿尔卡斯圣坛"
mDesc="在此城镇控制区域内，你的英雄施放的火系法术会提高一个等级。"

[A_Fortress_ThievesGuild H7TownThiefGuild]
mName="潜行公会"
mDesc="提供支付获取对手信息的选项。"

[A_Fortress_TownPortal H7TownPortal]
mName="城镇传送门"
mDesc="向所有拜访本城镇的英雄提供瞬间回城法术。\n使拥有此法术的英雄在这是最近的可用城镇时能够返回此城镇。"

[A_Fortress_Moat H7TownMoat]
mName="护城河"
mDesc="在攻城战中为城镇装备护城河。\n踏入其中的敌方生物将被中断并获得火系魔法易伤。"

[A_Fortress_RunicFortifications H7TownFortificationEnhancer]
mName="符文强化"
mDesc="城镇的城墙、城门和塔楼拥有30%更多生命值。在此城镇控制区域内的每场战斗开始时，你的英雄获得符文陷阱能力：每个敌方生物在其每个回合有20%几率在本回合内无法移动。"

[A_Fortress_Furnace H7TownFurnace]
mName="壁炉"
mDesc="每天生产2单位 %icon_ore 矿石和1单位 %icon_Crystal 水晶和 %icon_starsilver 星银。"

[A_Fortress_ArkathsEternalFlame H7TownTearOfAsha]
mName="阿尔卡斯的永恒之焰"
mDesc="每天提供5000 %ICON_GOLD 黄金并增加此城镇50%的生物产量。建造时提供四个主要宝物、四个圣器和宝物火龙兽。"

[fortressbuildingabilities.A_Fortress_ArkathsEternalFlame_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[fortressbuildingabilities.A_Fortress_Embassy_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[fortressbuildingabilities.A_Fortress_RuneAtelier_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[fortressbuildingabilities.A_Fortress_RuneAtelier_Buff_Hero H7BaseBuff]
mName="符文工坊"
mTooltip="在此控制区域内，符文魔法技能的符文光环能力效果增强50%。"

[fortressbuildingabilities.A_Fortress_RuneAtelier_Buff_Rune H7BaseBuff]
mName="符文工坊"
mTooltip="此符文的光环能力效果增强50%。"

[fortressbuildingabilities.A_Fortress_SacredFire_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[fortressbuildingabilities.A_Fortress_SacredFire_Buff_Hero H7BaseBuff]
mName="圣火"
mTooltip="接下来的 %durnow 场战斗中，%stat1 %icon_attack 攻击和 %stat2 %icon_morale 领导力。"

[fortressbuildingabilities.A_Fortress_ShrineOfArkath_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[fortressbuildingabilities.A_Fortress_RunicFortifications_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[fortressbuildingabilities.A_Fortress_ShrineOfArkath_Buff_Hero H7BaseBuff]
mName="阿尔卡斯圣坛"
mTooltip="英雄在当前控制区域内施放火系法术提高一个等级。"

[fortressbuildingabilities.A_Fortress_RunicFortifications_Buff_Custom H7BaseBuff]
mName="符文强化"
mTooltip="在此城镇控制区域内的每场战斗中，每个敌方生物在其每个回合有 %d.min% 几率在本回合内无法移动。"

版本 1.30：

新增替代T5单位，硫磺/火山魔像，以及隐藏能力

v1.37：

修正塔楼描述以说明防守者属性增益
进行了许多修正和调整，使各城堡的描述更加一致和正确